// data/questions.js

export const questions = ref([
  {
    id: 1,
    questionText: "Я принимаю информацию, не давая ей оценочных суждений.",
    relatedArchetype: "мудрец",
  },
  {
    id: 2,
    questionText:
      "Постоянные перемены в жизни порой выводят меня из равновесия.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 3,
    questionText:
      "Мой процесс внутреннего исцеления помогает мне поддерживать других в их пути к восстановлению.",
    relatedArchetype: "маг",
  },
  {
    id: 4,
    questionText: "Были случаи, когда я разочаровывал(а) людей.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 5,
    questionText: "У меня есть ощущение внутренней защищенности.",
    relatedArchetype: "простодушный",
  },
  {
    id: 6,
    questionText: "Я преодолеваю страх, чтобы сделать то, что нужно.",
    relatedArchetype: "воин",
  },
  {
    id: 7,
    questionText: "Я часто ставлю интересы других выше своих собственных.",
    relatedArchetype: "опекун",
  },
  {
    id: 8,
    questionText:
      "Я стремлюсь оставаться искренним(ей) с собой независимо от обстоятельств.",
    relatedArchetype: "творец",
  },
  {
    id: 9,
    questionText:
      "Когда жизнь становится однообразной, я стараюсь привнести в нее новые эмоции.",
    relatedArchetype: "шут",
  },
  {
    id: 10,
    questionText: "Забота о других приносит мне радость и удовлетворение.",
    relatedArchetype: "опекун",
  },
  {
    id: 11,
    questionText: "Люди часто считают меня жизнерадостным(ой).",
    relatedArchetype: "шут",
  },
  {
    id: 12,
    questionText:
      "Я ощущаю себя привлекательным(ой) и уверенным(ой) в своей сексуальности.",
    relatedArchetype: "любовник",
  },
  {
    id: 13,
    questionText: "Я верю, что люди в своей сути не стремятся причинять боль.",
    relatedArchetype: "простодушный",
  },
  {
    id: 14,
    questionText:
      "В детстве я столкнулся(лась) с травматичным опытом или нехваткой эмоциональной поддержки.",
    relatedArchetype: "сирота",
  },
  {
    id: 15,
    questionText: "Мне доставляет больше радости отдавать, чем получать.",
    relatedArchetype: "опекун",
  },
  {
    id: 16,
    questionText:
      "Я согласен(на) с мыслью: «Лучше испытать любовь, даже если она утрачена, чем не знать ее совсем».",
    relatedArchetype: "любовник",
  },
  {
    id: 17,
    questionText: "Мне нравится быть в центре внимания и устанавливать тренды:",
    relatedArchetype: "любовник",
  },
  {
    id: 18,
    questionText:
      "Я стараюсь предусмотреть возможные варианты развития событий.",
    relatedArchetype: "мудрец",
  },
  {
    id: 19,
    questionText: "Я осознаю, что создаю свою реальность.",
    relatedArchetype: "творец",
  },
  {
    id: 20,
    questionText:
      "Я убежден(а), что существует множество правильных взглядов на одну и ту же ситуацию.",
    relatedArchetype: "мудрец",
  },
  {
    id: 21,
    questionText:
      "Я осознаю, что со временем изменился(ась) и стал(а) другим человеком.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 22,
    questionText: "Я воспринимаю жизнь как череду сложных испытаний.",
    relatedArchetype: "сирота",
  },
  {
    id: 23,
    questionText:
      "Моим успехам во многом способствует ощущение поддержки высших сил.",
    relatedArchetype: "маг",
  },
  {
    id: 24,
    questionText:
      "Мне легче выполнять что-то для других, чем для самого(ой) себя.",
    relatedArchetype: "опекун",
  },
  {
    id: 25,
    questionText: "В отношениях я нахожу истинное удовлетворение.",
    relatedArchetype: "любовник",
  },
  {
    id: 26,
    questionText: "Люди часто ищут у меня совета или поддержки.",
    relatedArchetype: "правитель",
  },
  {
    id: 27,
    questionText:
      "Я испытываю недоверие к тем, кто обладает значительной властью.",
    relatedArchetype: "сирота",
  },
  {
    id: 28,
    questionText: "Я не всегда придерживаюсь установленных правил.",
    relatedArchetype: "шут",
  },
  {
    id: 29,
    questionText: "Мне нравится помогать людям лучше понимать друг друга.",
    relatedArchetype: "любовник",
  },
  {
    id: 30,
    questionText: "Бывают моменты, когда я ощущаю одиночество и покинутость.",
    relatedArchetype: "сирота",
  },
  {
    id: 31,
    questionText:
      "Иногда я достигаю впечатляющих результатов практически без усилий.",
    relatedArchetype: "творец",
  },
  {
    id: 32,
    questionText:
      "У меня есть качества, которые делают меня хорошим(ей) лидером.",
    relatedArchetype: "правитель",
  },
  {
    id: 33,
    questionText: "Я стараюсь постоянно развиваться и становиться лучше.",
    relatedArchetype: "искатель",
  },
  {
    id: 34,
    questionText: "Я могу рассчитывать, что другие проявят заботу обо мне.",
    relatedArchetype: "простодушный",
  },
  {
    id: 35,
    questionText: "Я предпочитаю занимать руководящую позицию.",
    relatedArchetype: "правитель",
  },
  {
    id: 36,
    questionText:
      "Я стараюсь развенчивать иллюзии и находить истину, скрытую за ними.",
    relatedArchetype: "мудрец",
  },
  {
    id: 37,
    questionText:
      "Я верю, что перемены в моем мышлении способны изменить мою жизнь.",
    relatedArchetype: "маг",
  },
  {
    id: 38,
    questionText:
      "Я создаю и развиваю ресурсы, будь то человеческие или природные.",
    relatedArchetype: "правитель",
  },
  {
    id: 39,
    questionText: "Я готов(а) рисковать, чтобы отстаивать свои убеждения.",
    relatedArchetype: "воин",
  },
  {
    id: 40,
    questionText:
      "Если что-то идет не так, я не могу оставаться в стороне и стараюсь внести свой вклад в изменения.",
    relatedArchetype: "воин",
  },
  {
    id: 41,
    questionText: "Я стремлюсь быть объективным(ой) и непредвзятым(ой).",
    relatedArchetype: "мудрец",
  },
  {
    id: 42,
    questionText: "Моё присутствие часто становится толчком для перемен.",
    relatedArchetype: "маг",
  },
  {
    id: 43,
    questionText: "Я люблю веселить людей и создавать атмосферу легкости.",
    relatedArchetype: "шут",
  },
  {
    id: 44,
    questionText: "Я придерживаюсь самодисциплины для достижения своих целей.",
    relatedArchetype: "воин",
  },
  {
    id: 45,
    questionText: "Я испытываю искреннюю любовь и симпатию к людям.",
    relatedArchetype: "любовник",
  },
  {
    id: 46,
    questionText:
      "Я хорошо различаю способности других и знаю, кому какая задача под силу.",
    relatedArchetype: "правитель",
  },
  {
    id: 47,
    questionText:
      "Для меня жизненно важно сохранять свою свободу и независимость.",
    relatedArchetype: "искатель",
  },
  {
    id: 48,
    questionText: "Я верю в глубокую взаимосвязь всего сущего.",
    relatedArchetype: "маг",
  },
  {
    id: 49,
    questionText: "Я ощущаю мир как безопасное и поддерживающее пространство.",
    relatedArchetype: "простодушный",
  },
  {
    id: 50,
    questionText:
      "Я сталкивался(лась) с предательством со стороны тех, кому доверял(а).",
    relatedArchetype: "сирота",
  },
  {
    id: 51,
    questionText: "Иногда я испытываю чувство тревоги и беспокойства.",
    relatedArchetype: "искатель",
  },
  {
    id: 52,
    questionText:
      "Я легко отпускаю то, что перестало мне подходить или служить.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 53,
    questionText:
      "Мне нравится разряжать серьезную обстановку шутками или лёгкими замечаниями.",
    relatedArchetype: "шут",
  },
  {
    id: 54,
    questionText:
      "Небольшая доля хаоса в жизни добавляет ей живости и энергии.",
    relatedArchetype: "шут",
  },
  {
    id: 55,
    questionText:
      "Помощь другим и самопожертвование сделали меня сильнее и мудрее.",
    relatedArchetype: "опекун",
  },
  {
    id: 56,
    questionText: "Я часто чувствую внутреннее умиротворение и спокойствие.",
    relatedArchetype: "мудрец",
  },
  {
    id: 57,
    questionText: "Я не боюсь защищать себя и отвечать на агрессию других.",
    relatedArchetype: "воин",
  },
  {
    id: 58,
    questionText:
      "Мне нравится превращать сложные ситуации во что-то новое и позитивное.",
    relatedArchetype: "маг",
  },
  {
    id: 59,
    questionText:
      "Я считаю, что дисциплина является основой успеха в любой сфере.",
    relatedArchetype: "воин",
  },
  {
    id: 60,
    questionText: "Вдохновение приходит ко мне легко, без особых усилий.",
    relatedArchetype: "творец",
  },
  {
    id: 61,
    questionText:
      "Иногда я чувствую, что не соответствую своим собственным ожиданиям.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 62,
    questionText:
      "Мне кажется, что где-то существует мир, в котором я буду по-настоящему счастлив(а).",
    relatedArchetype: "искатель",
  },
  {
    id: 63,
    questionText:
      "Я склонен(а) доверять людям, которые появляются в моей жизни.",
    relatedArchetype: "простодушный",
  },
  {
    id: 64,
    questionText:
      "Я пробую воплощать свои мечты в реальность через эксперименты.",
    relatedArchetype: "творец",
  },
  {
    id: 65,
    questionText:
      "Я уверен(а), что мои потребности будут удовлетворены в нужное время.",
    relatedArchetype: "простодушный",
  },
  {
    id: 66,
    questionText:
      "У меня бывает ощущение, что я нахожусь на грани разрушения чего-то важного.",
    relatedArchetype: "бунтарь",
  },
  {
    id: 67,
    questionText:
      "Я стараюсь принимать решения, учитывая благо всех, кого это касается.",
    relatedArchetype: "правитель",
  },
  {
    id: 68,
    questionText: "Мне бывает сложно отказывать другим.",
    relatedArchetype: "опекун",
  },
  {
    id: 69,
    questionText:
      "У меня много интересных идей, но не всегда хватает времени на их реализацию.",
    relatedArchetype: "творец",
  },
  {
    id: 70,
    questionText:
      "Я нахожусь в постоянном поиске места, где «жизнь будет лучше».",
    relatedArchetype: "искатель",
  },
  {
    id: 71,
    questionText: "Люди, которым я доверял(а), иногда меня разочаровывали.",
    relatedArchetype: "сирота",
  },
  {
    id: 72,
    questionText:
      "Для меня процесс поиска не менее важен, чем достижение цели.",
    relatedArchetype: "искатель",
  },
]);
